//------------------------------------------------------------------------------
// includes
document.write('\
	<script src="/data/engine/core/cShader.js"></script>\
	<script src="/data/engine/core/cCamera.js"></script>\
	<script src="/data/engine/core/cPlayer.js"></script>\
	<script src="/data/engine/core/cDraw.js"></script>\
	<script src="/data/engine/core/cLoadtexture.js"></script>\
	<script src="/data/engine/core/cObjs.js"></script>\
	<script src="/data/engine/core/cFps.js"></script>\
	<script src="/data/engine/physics/cCollision2d.js"></script>\
	<script src="/data/engine/main.js" defer></script>\
');
//------------------------------------------------------------------------------
// Интерфейс
document.write('\
	<div id="fps">0</div>\
	<div id="objData">0</div>\
	<div id="cam">0</div>\
	<div id="pawn">0</div>\
');
//------------------------------------------------------------------------------
class Map
{
	//--------------------------------------------------------------------------
	// Цвет неба
	sr = 0;
	sg = 0;
	sb = 0;
	//--------------------------------------------------------------------------
	// Спавн игрока X, Y, Z
	pawnx = 0;
	pawny = 0;
	pawnz = -15;
	// Куда смотрит игрок rX, rY
	pawnrx = 0;
	pawnry = 180;
	//--
	Speed = 0.1;// Скорость игрока
	grav = 0;// Гравитация игрока
	collis = false;// Проверка коллизии игрока
	//--------------------------------------------------------------------------
	// Карта
	imgpath = "test";// Папка с изображениями
	typeimg = ".jpg";// Формат изображений
	countimg = 5;// Количество изображений
	//--------------------------------------------------------------------------
	setmap = [
	//  [x,y,z,rx,ry,rz,sx,sy,sz,idimg,objType],
		[0,0,0,0,0,0,1,1,1,0,0],// 0 point
		[3,0,0,0,0,0,1,1,1,1,0],// 1 line
		[0,3,0,0,0,0,1,1,1,3,0],// 2 triangle90
		[0,0,3,0,0,0,1,1,1,2,0],// 3 triangle
		[6,0,0,0,0,0,1,1,1,3,0],// 4 square
		[-3,3,0,0,0,0,1,1,1,0,0],// 5
		// [0,-6,0,0,0,30,1,1,0.1,6],// 6
		// [0,5,0,0,30,0,1,3,0.1,7],// 7
		// [-6,6,-10,0,30,0,1,1,0.1,8],// 8
		// [6,6,-10,30,0,0,3,1,0.1,9],// 9
	];
	//--------------------------------------------------------------------------
	constructor() {}
}
//------------------------------------------------------------------------------
